Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_КоммерческоеПредложениеОтПоставщика/TK_КоммерческоеПредложениеОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TK_КоммерческоеПредложениеОтПоставщика</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсииЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросЦенПоставщикам</name>
    <type>
      <types>DocumentRef.TK_ЗапросЦенПоставщикам</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКонтактногоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтрокиЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураТекстом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВключаетНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийОтПоставщика</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийКомментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропущено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей_115_демо_.Teklifo/src/Catalogs/TK_УведомленияИнтеграцииСTeklifo/TK_УведомленияИнтеграцииСTeklifo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TK_УведомленияИнтеграцииСTeklifo</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстУведомления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef.TK_ЗапросЦенПоставщикам</types>
      <types>DocumentRef.TK_ЗапросЦенОтКлиента</types>
      <types>DocumentRef.TK_КоммерческоеПредложениеКлиенту</types>
      <types>DocumentRef.TK_КоммерческоеПредложениеОтПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_торговлей_115_демо_.Teklifo/src/CommonModules/TK_РаботаСУведомлениямиTeklifo/Module.bsl
#Область ПрограммныйИнтерфейс

// Создать уведомление о новом коммеческом предложении от поставщика.
// 
// Параметры:
//  РеквизитыКоммерческогоПредложения - см. РеквизитыКоммерческогоПредложенияОтПоставщика
Процедура СоздатьУведомлениеОНовомКоммеческомПредложенииОтПоставщика(РеквизитыКоммерческогоПредложения) Экспорт

	ПараметрыУведомления = НоваяСтруктураПараметровУведомления();

	ПараметрыУведомления.Важность = 1;
	ПараметрыУведомления.Наименование = НСтр("ru = 'Получено новое коммерческое предложение!'");
	ПараметрыУведомления.Организация = РеквизитыКоммерческогоПредложения.Организация;
	ПараметрыУведомления.Предмет = РеквизитыКоммерческогоПредложения.Ссылка;
	ПараметрыУведомления.ТекстУведомления = ТекстУведомленияОНовомКоммерческомПредложении(
		РеквизитыКоммерческогоПредложения);

	СоздатьУведомление(ПараметрыУведомления);

КонецПроцедуры

// Создать уведомление.
// 
// Параметры:
//  ПараметрыУведомления - см. НоваяСтруктураПараметровУведомления
Процедура СоздатьУведомление(ПараметрыУведомления) Экспорт

	ОбъектУведомления = Справочники.TK_УведомленияИнтеграцииСTeklifo.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ОбъектУведомления, ПараметрыУведомления, , "ТекстУведомления");

	ОбъектУведомления.ТекстУведомления = "<html><head></head><body>" + ПараметрыУведомления.ТекстУведомления
		+ "</body></html>";

	УстановитьПривилегированныйРежим(Истина);

	Попытка
		ОбъектУведомления.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Создание уведомления Teklifo", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Реквизиты коммерческого предложения от поставщика для создания уведомления.
// 
// Возвращаемое значение:
//  Структура:
// * Организация - СправочникСсылка.Организации - 
// * Ссылка - ДокументСсылка.TK_КоммерческоеПредложениеОтПоставщика 
// * ЗапросЦенПоставщикам - ДокументСсылка.TK_ЗапросЦенПоставщикам
// * Контрагент - СправочникСсылка.Контрагенты
Функция НоваяСтруктураРеквизитовКоммерческогоПредложенияОтПоставщика() Экспорт

	Структура = Новый Структура;

	Структура.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Структура.Вставить("Ссылка", Документы.TK_КоммерческоеПредложениеОтПоставщика.ПустаяСсылка());
	Структура.Вставить("ЗапросЦенПоставщикам", Документы.TK_ЗапросЦенПоставщикам.ПустаяСсылка());
	Структура.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());

	Возврат Структура;

КонецФункции

// Структура параметров уведомления.
// 
// Возвращаемое значение:
//  Структура:
// * Наименование - Строка 
// * Организация - СправочникСсылка.Организации 
// * Дата - Дата 
// * ТекстУведомления - Строка 
// * Предмет - Неопределено 
// * Важность - Число
Функция НоваяСтруктураПараметровУведомления() Экспорт

	Структура = Новый Структура;

	Структура.Вставить("Наименование", "");
	Структура.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Структура.Вставить("Дата", ТекущаяДатаСеанса());
	Структура.Вставить("ТекстУведомления", "");
	Структура.Вставить("Предмет", Неопределено);
	Структура.Вставить("Важность", 0);

	Возврат Структура;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстУведомленияОНовомКоммерческомПредложении(РеквизитыКоммерческогоПредложения)

	Текст = СтрШаблон(НСтр("ru = 'Получено новое коммерческое от поставщика ""%1"" на основании документа ""%2"".'"),
		РеквизитыКоммерческогоПредложения.Контрагент, РеквизитыКоммерческогоПредложения.ЗапросЦенПоставщикам);

	Возврат "<p>" + Текст + "</p>";

КонецФункции

#КонецОбласти
